; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c4-s5-p17-a1)
(:domain logistics-strips)
(:objects a0 
          c0 c1 c2 c3 
          t0 t1 t2 t3 
          l0-0 l0-1 l0-2 l0-3 l0-4 l1-0 l1-1 l1-2 l1-3 l1-4 l2-0 l2-1 l2-2 l2-3 l2-4 l3-0 l3-1 l3-2 l3-3 l3-4 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 
)
(:init
    (AIRPLANE a0)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (OBJ p13)
    (OBJ p14)
    (OBJ p15)
    (OBJ p16)
    (at t0 l0-1)
    (at t1 l1-4)
    (at t2 l2-2)
    (at t3 l3-1)
    (at p0 l0-2)
    (at p1 l2-2)
    (at p2 l1-0)
    (at p3 l2-0)
    (at p4 l0-3)
    (at p5 l1-0)
    (at p6 l2-3)
    (at p7 l3-3)
    (at p8 l1-4)
    (at p9 l0-4)
    (at p10 l3-3)
    (at p11 l0-2)
    (at p12 l1-2)
    (at p13 l3-1)
    (at p14 l1-0)
    (at p15 l3-2)
    (at p16 l1-4)
    (at a0 l3-0)
)
(:goal
    (and
        (at p0 l2-0)
        (at p1 l2-4)
        (at p2 l0-3)
        (at p3 l3-2)
        (at p4 l0-0)
        (at p5 l2-2)
        (at p6 l0-0)
        (at p7 l0-3)
        (at p8 l2-4)
        (at p9 l1-2)
        (at p10 l3-4)
        (at p11 l2-4)
        (at p12 l2-3)
        (at p13 l0-1)
        (at p14 l0-2)
        (at p15 l2-1)
        (at p16 l0-4)
    )
)

  (:constraints
    (and
      (always (not (in p1 a0)))
      (always (not (in p10 a0)))
      (always (not (in p4 a0)))
    )
  )
)

; plan
1. (load-truck p13 t3 l3-1)
   deleted: (at p13 l3-1)
   added: (in p13 t3)
   goals met: 0 of 17
2. (load-truck p1 t2 l2-2)
   deleted: (at p1 l2-2)
   added: (in p1 t2)
   goals met: 0 of 17
3. (load-truck p8 t1 l1-4)
   deleted: (at p8 l1-4)
   added: (in p8 t1)
   goals met: 0 of 17
4. (load-truck p16 t1 l1-4)
   deleted: (at p16 l1-4)
   added: (in p16 t1)
   goals met: 0 of 17
5. (fly-airplane a0 l3-0 l2-0)
   deleted: (at a0 l3-0)
   added: (at a0 l2-0)
   goals met: 0 of 17
6. (drive-truck t0 l0-1 l0-4 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-4)
   goals met: 0 of 17
7. (drive-truck t3 l3-1 l3-4 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-4)
   goals met: 0 of 17
8. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 0 of 17
9. (load-airplane p3 a0 l2-0)
   deleted: (at p3 l2-0)
   added: (in p3 a0)
   goals met: 0 of 17
10. (drive-truck t2 l2-2 l2-4 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-4)
   goals met: 0 of 17
11. (load-truck p9 t0 l0-4)
   deleted: (at p9 l0-4)
   added: (in p9 t0)
   goals met: 0 of 17
12. (load-truck p12 t1 l1-2)
   deleted: (at p12 l1-2)
   added: (in p12 t1)
   goals met: 0 of 17
13. (unload-truck p1 t2 l2-4)
   deleted: (in p1 t2)
   added: (at p1 l2-4)
   goals met: 1 of 17
14. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 1 of 17
15. (drive-truck t0 l0-4 l0-3 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-3)
   goals met: 1 of 17
16. (drive-truck t3 l3-4 l3-3 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-3)
   goals met: 1 of 17
17. (load-airplane p5 a0 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 a0)
   goals met: 1 of 17
18. (load-airplane p2 a0 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 a0)
   goals met: 1 of 17
19. (load-airplane p14 a0 l1-0)
   deleted: (at p14 l1-0)
   added: (in p14 a0)
   goals met: 1 of 17
20. (load-truck p4 t0 l0-3)
   deleted: (at p4 l0-3)
   added: (in p4 t0)
   goals met: 1 of 17
21. (load-truck p7 t3 l3-3)
   deleted: (at p7 l3-3)
   added: (in p7 t3)
   goals met: 1 of 17
22. (load-truck p10 t3 l3-3)
   deleted: (at p10 l3-3)
   added: (in p10 t3)
   goals met: 1 of 17
23. (drive-truck t2 l2-4 l2-3 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-3)
   goals met: 1 of 17
24. (drive-truck t1 l1-2 l1-0 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-0)
   goals met: 1 of 17
25. (drive-truck t3 l3-3 l3-4 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-4)
   goals met: 1 of 17
26. (load-truck p6 t2 l2-3)
   deleted: (at p6 l2-3)
   added: (in p6 t2)
   goals met: 1 of 17
27. (unload-truck p8 t1 l1-0)
   deleted: (in p8 t1)
   added: (at p8 l1-0)
   goals met: 1 of 17
28. (unload-truck p16 t1 l1-0)
   deleted: (in p16 t1)
   added: (at p16 l1-0)
   goals met: 1 of 17
29. (unload-truck p12 t1 l1-0)
   deleted: (in p12 t1)
   added: (at p12 l1-0)
   goals met: 1 of 17
30. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 1 of 17
31. (unload-truck p10 t3 l3-4)
   deleted: (in p10 t3)
   added: (at p10 l3-4)
   goals met: 2 of 17
32. (load-airplane p8 a0 l1-0)
   deleted: (at p8 l1-0)
   added: (in p8 a0)
   goals met: 2 of 17
33. (load-airplane p16 a0 l1-0)
   deleted: (at p16 l1-0)
   added: (in p16 a0)
   goals met: 2 of 17
34. (load-airplane p12 a0 l1-0)
   deleted: (at p12 l1-0)
   added: (in p12 a0)
   goals met: 2 of 17
35. (load-truck p11 t0 l0-2)
   deleted: (at p11 l0-2)
   added: (in p11 t0)
   goals met: 2 of 17
36. (load-truck p0 t0 l0-2)
   deleted: (at p0 l0-2)
   added: (in p0 t0)
   goals met: 2 of 17
37. (drive-truck t2 l2-3 l2-0 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-0)
   goals met: 2 of 17
38. (drive-truck t3 l3-4 l3-2 c3)
   deleted: (at t3 l3-4)
   added: (at t3 l3-2)
   goals met: 2 of 17
39. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 2 of 17
40. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 2 of 17
41. (drive-truck t0 l0-2 l0-0 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-0)
   goals met: 2 of 17
42. (load-truck p15 t3 l3-2)
   deleted: (at p15 l3-2)
   added: (in p15 t3)
   goals met: 2 of 17
43. (unload-airplane p8 a0 l2-0)
   deleted: (in p8 a0)
   added: (at p8 l2-0)
   goals met: 2 of 17
44. (unload-airplane p5 a0 l2-0)
   deleted: (in p5 a0)
   added: (at p5 l2-0)
   goals met: 2 of 17
45. (unload-airplane p12 a0 l2-0)
   deleted: (in p12 a0)
   added: (at p12 l2-0)
   goals met: 2 of 17
46. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 2 of 17
47. (unload-truck p9 t0 l0-0)
   deleted: (in p9 t0)
   added: (at p9 l0-0)
   goals met: 2 of 17
48. (unload-truck p11 t0 l0-0)
   deleted: (in p11 t0)
   added: (at p11 l0-0)
   goals met: 2 of 17
49. (unload-truck p0 t0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 2 of 17
50. (load-truck p8 t2 l2-0)
   deleted: (at p8 l2-0)
   added: (in p8 t2)
   goals met: 2 of 17
51. (load-truck p5 t2 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 t2)
   goals met: 2 of 17
52. (load-truck p12 t2 l2-0)
   deleted: (at p12 l2-0)
   added: (in p12 t2)
   goals met: 2 of 17
53. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 2 of 17
54. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 2 of 17
55. (unload-airplane p6 a0 l0-0)
   deleted: (in p6 a0)
   added: (at p6 l0-0)
   goals met: 3 of 17
56. (unload-airplane p2 a0 l0-0)
   deleted: (in p2 a0)
   added: (at p2 l0-0)
   goals met: 3 of 17
57. (unload-airplane p16 a0 l0-0)
   deleted: (in p16 a0)
   added: (at p16 l0-0)
   goals met: 3 of 17
58. (unload-airplane p14 a0 l0-0)
   deleted: (in p14 a0)
   added: (at p14 l0-0)
   goals met: 3 of 17
59. (load-airplane p9 a0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 a0)
   goals met: 3 of 17
60. (load-airplane p11 a0 l0-0)
   deleted: (at p11 l0-0)
   added: (in p11 a0)
   goals met: 3 of 17
61. (load-airplane p0 a0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 3 of 17
62. (drive-truck t2 l2-0 l2-4 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-4)
   goals met: 3 of 17
63. (unload-truck p7 t3 l3-0)
   deleted: (in p7 t3)
   added: (at p7 l3-0)
   goals met: 3 of 17
64. (unload-truck p15 t3 l3-0)
   deleted: (in p15 t3)
   added: (at p15 l3-0)
   goals met: 3 of 17
65. (unload-truck p13 t3 l3-0)
   deleted: (in p13 t3)
   added: (at p13 l3-0)
   goals met: 3 of 17
66. (unload-truck p4 t0 l0-0)
   deleted: (in p4 t0)
   added: (at p4 l0-0)
   goals met: 4 of 17
67. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 4 of 17
68. (load-truck p2 t0 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 4 of 17
69. (load-truck p16 t0 l0-0)
   deleted: (at p16 l0-0)
   added: (in p16 t0)
   goals met: 4 of 17
70. (load-truck p14 t0 l0-0)
   deleted: (at p14 l0-0)
   added: (in p14 t0)
   goals met: 4 of 17
71. (unload-truck p8 t2 l2-4)
   deleted: (in p8 t2)
   added: (at p8 l2-4)
   goals met: 5 of 17
72. (unload-airplane p11 a0 l2-0)
   deleted: (in p11 a0)
   added: (at p11 l2-0)
   goals met: 5 of 17
73. (unload-airplane p0 a0 l2-0)
   deleted: (in p0 a0)
   added: (at p0 l2-0)
   goals met: 6 of 17
74. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 6 of 17
75. (drive-truck t2 l2-4 l2-3 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-3)
   goals met: 6 of 17
76. (unload-truck p16 t0 l0-4)
   deleted: (in p16 t0)
   added: (at p16 l0-4)
   goals met: 7 of 17
77. (unload-truck p12 t2 l2-3)
   deleted: (in p12 t2)
   added: (at p12 l2-3)
   goals met: 8 of 17
78. (fly-airplane a0 l2-0 l1-0)
   deleted: (at a0 l2-0)
   added: (at a0 l1-0)
   goals met: 8 of 17
79. (unload-airplane p9 a0 l1-0)
   deleted: (in p9 a0)
   added: (at p9 l1-0)
   goals met: 8 of 17
80. (drive-truck t0 l0-4 l0-3 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-3)
   goals met: 8 of 17
81. (drive-truck t2 l2-3 l2-4 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-4)
   goals met: 8 of 17
82. (unload-truck p2 t0 l0-3)
   deleted: (in p2 t0)
   added: (at p2 l0-3)
   goals met: 9 of 17
83. (fly-airplane a0 l1-0 l2-0)
   deleted: (at a0 l1-0)
   added: (at a0 l2-0)
   goals met: 9 of 17
84. (load-truck p9 t1 l1-0)
   deleted: (at p9 l1-0)
   added: (in p9 t1)
   goals met: 9 of 17
85. (drive-truck t2 l2-4 l2-0 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-0)
   goals met: 9 of 17
86. (drive-truck t1 l1-0 l1-2 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-2)
   goals met: 9 of 17
87. (load-truck p11 t2 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 t2)
   goals met: 9 of 17
88. (drive-truck t0 l0-3 l0-2 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-2)
   goals met: 9 of 17
89. (fly-airplane a0 l2-0 l3-0)
   deleted: (at a0 l2-0)
   added: (at a0 l3-0)
   goals met: 9 of 17
90. (unload-truck p9 t1 l1-2)
   deleted: (in p9 t1)
   added: (at p9 l1-2)
   goals met: 10 of 17
91. (unload-truck p14 t0 l0-2)
   deleted: (in p14 t0)
   added: (at p14 l0-2)
   goals met: 11 of 17
92. (drive-truck t2 l2-0 l2-4 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-4)
   goals met: 11 of 17
93. (unload-airplane p3 a0 l3-0)
   deleted: (in p3 a0)
   added: (at p3 l3-0)
   goals met: 11 of 17
94. (load-airplane p7 a0 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 a0)
   goals met: 11 of 17
95. (load-airplane p15 a0 l3-0)
   deleted: (at p15 l3-0)
   added: (in p15 a0)
   goals met: 11 of 17
96. (load-airplane p13 a0 l3-0)
   deleted: (at p13 l3-0)
   added: (in p13 a0)
   goals met: 11 of 17
97. (drive-truck t0 l0-2 l0-3 c0)
   deleted: (at t0 l0-2)
   added: (at t0 l0-3)
   goals met: 11 of 17
98. (unload-truck p11 t2 l2-4)
   deleted: (in p11 t2)
   added: (at p11 l2-4)
   goals met: 12 of 17
99. (fly-airplane a0 l3-0 l2-0)
   deleted: (at a0 l3-0)
   added: (at a0 l2-0)
   goals met: 12 of 17
100. (load-truck p3 t3 l3-0)
   deleted: (at p3 l3-0)
   added: (in p3 t3)
   goals met: 12 of 17
101. (unload-airplane p15 a0 l2-0)
   deleted: (in p15 a0)
   added: (at p15 l2-0)
   goals met: 12 of 17
102. (drive-truck t0 l0-3 l0-0 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-0)
   goals met: 12 of 17
103. (drive-truck t2 l2-4 l2-1 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-1)
   goals met: 12 of 17
104. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 12 of 17
105. (fly-airplane a0 l2-0 l0-0)
   deleted: (at a0 l2-0)
   added: (at a0 l0-0)
   goals met: 12 of 17
106. (unload-truck p3 t3 l3-2)
   deleted: (in p3 t3)
   added: (at p3 l3-2)
   goals met: 13 of 17
107. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 13 of 17
108. (unload-airplane p7 a0 l0-0)
   deleted: (in p7 a0)
   added: (at p7 l0-0)
   goals met: 13 of 17
109. (unload-airplane p13 a0 l0-0)
   deleted: (in p13 a0)
   added: (at p13 l0-0)
   goals met: 13 of 17
110. (load-truck p15 t2 l2-0)
   deleted: (at p15 l2-0)
   added: (in p15 t2)
   goals met: 13 of 17
111. (load-truck p7 t0 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 13 of 17
112. (load-truck p13 t0 l0-0)
   deleted: (at p13 l0-0)
   added: (in p13 t0)
   goals met: 13 of 17
113. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 13 of 17
114. (drive-truck t0 l0-0 l0-3 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-3)
   goals met: 13 of 17
115. (unload-truck p15 t2 l2-1)
   deleted: (in p15 t2)
   added: (at p15 l2-1)
   goals met: 14 of 17
116. (unload-truck p7 t0 l0-3)
   deleted: (in p7 t0)
   added: (at p7 l0-3)
   goals met: 15 of 17
117. (drive-truck t2 l2-1 l2-2 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-2)
   goals met: 15 of 17
118. (drive-truck t0 l0-3 l0-1 c0)
   deleted: (at t0 l0-3)
   added: (at t0 l0-1)
   goals met: 15 of 17
119. (unload-truck p5 t2 l2-2)
   deleted: (in p5 t2)
   added: (at p5 l2-2)
   goals met: 16 of 17
120. (unload-truck p13 t0 l0-1)
   deleted: (in p13 t0)
   added: (at p13 l0-1)
   goals met: 17 of 17
